open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_dma2d.c
/****************************************************************************
 * chips/bk7258/ap/bk7258_dma2d.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * BK7258 AP DMA2D typed helper.  The immutable BK7258 v3.1.1.9 bundle
 * exports the public driver/dma2d.h data path from libdriver.a.  NuttX has no
 * generic DMA2D upper-half, therefore this file intentionally exposes board
 * operations for an existing framebuffer/video owner rather than a device
 * node or a private character ABI.
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <limits.h>
#include <stdbool.h>
#include <stdint.h>

#include <nuttx/cache.h>
#include <nuttx/clock.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>

/* These are public v3.1.1.9 bundle headers.  Do not replace them with the
 * SDK source tree or private HAL headers. */

#include <common/bk_err.h>
#include <driver/dma2d.h>

#include <arch/chip/bk7258_dma2d.h>

#define BK7258_DMA2D_DEFAULT_TIMEOUT_MS 1000
#define BK7258_DMA2D_OFFSET_MAX         0x3fff
#define BK7258_DMA2D_IRQ_MASK           (DMA2D_CFG_ERROR | \
                                         DMA2D_TRANS_ERROR | \
                                         DMA2D_TRANS_COMPLETE)
#define BK7258_DMA2D_IRQ_PENDING        (-EINPROGRESS)

/* v3.1.1.9 routes DMA2D source 28 to physical CPU2.  NuttX AP logical CPU0
 * runs on physical CPU1, so move the group-1 route after SDK init just as the
 * RGB display wrapper does for source 27. */

#define BK7258_DMA2D_AP_PRIMARY_CORE_ID  1u
#define BK7258_DMA2D_SDK_DEFAULT_CORE_ID 2u
#define BK7258_DMA2D_INTERRUPT_CTRL_BIT  (1u << 28)
#define BK7258_DMA2D_MODULE_CTRL_REG      0x48080008u
#define BK7258_DMA2D_MODULE_CLK_GATE      (1u << 1)

extern int32_t sys_drv_core_intr_group1_disable(uint32_t core_id,
                                                uint32_t param);
extern int32_t sys_drv_core_intr_group1_enable(uint32_t core_id,
                                               uint32_t param);

struct bk7258_dma2d_s
{
  mutex_t lock;
  sem_t completion;
  volatile bool operation_active;
  volatile int irq_result;
  bool initialized;
  bool faulted;
  bool mode_valid;
  dma2d_mode_t last_mode;
};

static struct bk7258_dma2d_s g_bk7258_dma2d =
{
  .lock = NXMUTEX_INITIALIZER,
  .completion = SEM_INITIALIZER(0),
};

/* The immutable AP sys_hal_dma2d_clk_en() is intentionally empty: shared
 * VIDP power is already handled by the CP-owned PM vote made immediately
 * before this call.  Its sys_drv_dma2d_set() wrapper nevertheless acquires
 * the SDK SYS_REG AMP lock and propagates a lock failure, which makes
 * bk_dma2d_driver_init() fail even though there is no register operation to
 * protect.  Keep the official driver sequence intact while making this one
 * AP no-op explicit at the chip compatibility boundary. */

bk_err_t __wrap_sys_drv_dma2d_set(uint32_t enable)
{
  (void)enable;
  return BK_OK;
}

static int bk7258_dma2d_sdk_error(bk_err_t error)
{
  switch (error)
    {
      case BK_OK:
        return 0;

      case BK_ERR_PARAM:
      case BK_ERR_NULL_PARAM:
        return -EINVAL;

      case BK_ERR_NO_MEM:
        return -ENOMEM;

      case BK_ERR_TIMEOUT:
        return -ETIMEDOUT;

      case BK_ERR_BUSY:
      case BK_ERR_IN_PROGRESS:
        return -EBUSY;

      case BK_ERR_NOT_SUPPORT:
        return -ENOTSUP;

      case BK_ERR_NO_DEV:
      case BK_ERR_NOT_FOUND:
        return -ENODEV;

      case BK_ERR_NOT_INIT:
      case BK_ERR_DMA2D_NOT_INIT:
        return -ENODEV;

      default:
        /* BK_FAIL and DMA2D-specific errors are SDK status values, not
         * NuttX errno values. */
        return -EIO;
    }
}

static int bk7258_dma2d_route_irq_to_ap_primary(void)
{
  int32_t ret;

  (void)sys_drv_core_intr_group1_disable(
          BK7258_DMA2D_SDK_DEFAULT_CORE_ID,
          BK7258_DMA2D_INTERRUPT_CTRL_BIT);
  ret = sys_drv_core_intr_group1_enable(BK7258_DMA2D_AP_PRIMARY_CORE_ID,
                                        BK7258_DMA2D_INTERRUPT_CTRL_BIT);
  return ret == 0 ? 0 : -EIO;
}

static void bk7258_dma2d_unroute_ap_primary_irq(void)
{
  (void)sys_drv_core_intr_group1_disable(
          BK7258_DMA2D_AP_PRIMARY_CORE_ID,
          BK7258_DMA2D_INTERRUPT_CTRL_BIT);
}

static int bk7258_dma2d_map_input(enum bk7258_dma2d_format_e format,
                                  input_color_mode_t *sdk_format)
{
  switch (format)
    {
      case BK7258_DMA2D_ARGB8888:
        *sdk_format = DMA2D_INPUT_ARGB8888;
        return 0;

      case BK7258_DMA2D_RGB888:
        *sdk_format = DMA2D_INPUT_RGB888;
        return 0;

      case BK7258_DMA2D_RGB565:
        *sdk_format = DMA2D_INPUT_RGB565;
        return 0;

      case BK7258_DMA2D_ARGB1555:
        *sdk_format = DMA2D_INPUT_ARGB1555;
        return 0;

      case BK7258_DMA2D_ARGB4444:
        *sdk_format = DMA2D_INPUT_ARGB4444;
        return 0;

      case BK7258_DMA2D_YUYV:
        *sdk_format = DMA2D_INPUT_YUYV;
        return 0;

      case BK7258_DMA2D_UYVY:
        *sdk_format = DMA2D_INPUT_UYVY;
        return 0;

      case BK7258_DMA2D_YYUV:
        *sdk_format = DMA2D_INPUT_YYUV;
        return 0;

      case BK7258_DMA2D_UVYY:
        *sdk_format = DMA2D_INPUT_UVYY;
        return 0;

      case BK7258_DMA2D_VUYY:
        *sdk_format = DMA2D_INPUT_VUYY;
        return 0;

      default:
        return -ENOTSUP;
    }
}

static int bk7258_dma2d_map_output(enum bk7258_dma2d_format_e format,
                                   out_color_mode_t *sdk_format)
{
  switch (format)
    {
      case BK7258_DMA2D_ARGB8888:
        *sdk_format = DMA2D_OUTPUT_ARGB8888;
        return 0;

      case BK7258_DMA2D_RGB888:
        *sdk_format = DMA2D_OUTPUT_RGB888;
        return 0;

      case BK7258_DMA2D_RGB565:
        *sdk_format = DMA2D_OUTPUT_RGB565;
        return 0;

      case BK7258_DMA2D_ARGB1555:
        *sdk_format = DMA2D_OUTPUT_ARGB1555;
        return 0;

      case BK7258_DMA2D_ARGB4444:
        *sdk_format = DMA2D_OUTPUT_ARGB4444;
        return 0;

