open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_dma2d.c
      case BK7258_DMA2D_YUYV:
        *sdk_format = DMA2D_OUTPUT_YUYV;
        return 0;

      case BK7258_DMA2D_UYVY:
        *sdk_format = DMA2D_OUTPUT_UYVY;
        return 0;

      case BK7258_DMA2D_YYUV:
        *sdk_format = DMA2D_OUTPUT_YYUV;
        return 0;

      case BK7258_DMA2D_UVYY:
        *sdk_format = DMA2D_OUTPUT_UVYY;
        return 0;

      case BK7258_DMA2D_VUYY:
        *sdk_format = DMA2D_OUTPUT_VUYY;
        return 0;

      default:
        return -ENOTSUP;
    }
}

static int bk7258_dma2d_pixel_bytes(enum bk7258_dma2d_format_e format)
{
  switch (format)
    {
      case BK7258_DMA2D_ARGB8888:
        return FOUR_BYTES;

      case BK7258_DMA2D_RGB888:
        return THREE_BYTES;

      case BK7258_DMA2D_RGB565:
      case BK7258_DMA2D_ARGB1555:
      case BK7258_DMA2D_ARGB4444:
      case BK7258_DMA2D_YUYV:
      case BK7258_DMA2D_UYVY:
      case BK7258_DMA2D_YYUV:
      case BK7258_DMA2D_UVYY:
      case BK7258_DMA2D_VUYY:
        return TWO_BYTES;

      default:
        return -ENOTSUP;
    }
}

static int bk7258_dma2d_map_alpha(enum bk7258_dma2d_alpha_e alpha,
                                  blend_alpha_mode_t *sdk_alpha)
{
  switch (alpha)
    {
      case BK7258_DMA2D_ALPHA_KEEP:
        *sdk_alpha = DMA2D_NO_MODIF_ALPHA;
        return 0;

      case BK7258_DMA2D_ALPHA_REPLACE:
        *sdk_alpha = DMA2D_REPLACE_ALPHA;
        return 0;

      case BK7258_DMA2D_ALPHA_COMBINE:
        *sdk_alpha = DMA2D_COMBINE_ALPHA;
        return 0;

      default:
        return -EINVAL;
    }
}

static int bk7258_dma2d_map_swap(enum bk7258_dma2d_swap_e swap,
                                 red_blue_swap_t *sdk_swap)
{
  switch (swap)
    {
      case BK7258_DMA2D_SWAP_REGULAR:
        *sdk_swap = DMA2D_RB_REGULAR;
        return 0;

      case BK7258_DMA2D_SWAP_RED_BLUE:
        *sdk_swap = DMA2D_RB_SWAP;
        return 0;

      default:
        return -EINVAL;
    }
}

static int bk7258_dma2d_map_reverse(enum bk7258_dma2d_reverse_e reverse,
                                    data_reverse_t *sdk_reverse)
{
  switch (reverse)
    {
      case BK7258_DMA2D_REVERSE_NONE:
        *sdk_reverse = NO_REVERSE;
        return 0;

      case BK7258_DMA2D_REVERSE_BYTE:
        *sdk_reverse = BYTE_BY_BYTE_REVERSE;
        return 0;

      case BK7258_DMA2D_REVERSE_HALFWORD:
        *sdk_reverse = HFWORD_BY_HFWORD_REVERSE;
        return 0;

      default:
        return -EINVAL;
    }
}

static int bk7258_dma2d_validate_extent(FAR const void *buffer,
                                        uint16_t frame_width,
                                        uint16_t frame_height,
                                        uint16_t x, uint16_t y,
                                        uint16_t width, uint16_t height,
                                        int pixel_bytes)
{
  uint64_t base;
  uint64_t last_offset;
  uint64_t last_pixel;
  uint64_t last_row;

  if (buffer == NULL || frame_width == 0 || frame_height == 0 ||
      width == 0 || height == 0 || pixel_bytes < TWO_BYTES)
    {
      return -EINVAL;
    }

  if ((uint32_t)x + width > frame_width ||
      (uint32_t)y + height > frame_height ||
      (uint32_t)frame_width - width > BK7258_DMA2D_OFFSET_MAX)
    {
      return -ERANGE;
    }

  /* The immutable SDK truncates addresses to uint32_t and computes the
   * rectangle offset internally.  Reject values that cannot be represented
   * by that ABI rather than silently truncating them. */

  base = (uintptr_t)buffer;
  if (base > UINT32_MAX)
    {
      return -EOVERFLOW;
    }

  /* The SDK computes the start address in 32-bit pointer arithmetic and the
   * DMA engine then walks every row using the frame stride.  Check the final
   * byte touched, not only the first pixel, so neither the row calculation
   * nor base-plus-offset can wrap. */

  last_row = (uint64_t)y + height - 1;
  last_pixel = last_row * frame_width + x;
  last_offset = last_pixel * pixel_bytes +
                (uint64_t)width * pixel_bytes - 1;
  if (last_offset > UINT32_MAX || base + last_offset > UINT32_MAX)
    {
      return -EOVERFLOW;
    }

  return 0;
}

static void bk7258_dma2d_cache_bounds(FAR const void *buffer,
                                      uint16_t frame_width,
                                      uint16_t x, uint16_t y,
                                      uint16_t width, uint16_t height,
                                      int pixel_bytes,
                                      FAR uintptr_t *start,
                                      FAR uintptr_t *end)
{
  *start = (uintptr_t)buffer +
           ((uint32_t)frame_width * y + x) * pixel_bytes;
  *end = (uintptr_t)buffer +
         (((uint32_t)frame_width * (y + height - 1) + x + width) *
          pixel_bytes);
}

static int bk7258_dma2d_timeout(uint32_t timeout_ms, FAR clock_t *ticks)
{
  if (timeout_ms == 0)
    {
      timeout_ms = BK7258_DMA2D_DEFAULT_TIMEOUT_MS;
    }

  *ticks = MSEC2TICK(timeout_ms);
  if (*ticks <= 0)
    {
      *ticks = 1;
    }

  return 0;
}

/* SDK DMA2D callbacks are invoked from DMA2D_Handler.  They only publish a
 * status and post the NuttX semaphore; no mutex or other blocking operation
 * is allowed in this ISR context. */

static void bk7258_dma2d_complete_isr(void *arg)
{
  FAR struct bk7258_dma2d_s *priv = arg;

  if (priv != &g_bk7258_dma2d)
    {
      return;
    }

  /* A completion cannot clear an error already published by an error
   * callback.  Both callbacks may be raised for one transfer. */

  if (priv->irq_result == BK7258_DMA2D_IRQ_PENDING)
    {
      priv->irq_result = 0;
    }

  if (priv->operation_active)
    {
      (void)nxsem_post(&priv->completion);
    }
}

static void bk7258_dma2d_error_isr(void *arg)
{
  FAR struct bk7258_dma2d_s *priv = arg;

  if (priv != &g_bk7258_dma2d)
    {
      return;
    }

  /* Keep an error sticky until the waiter consumes this transfer.  A later
   * completion callback must not turn this operation into success. */

  priv->irq_result = -EIO;
  if (priv->operation_active)
    {
      (void)nxsem_post(&priv->completion);
    }
}

