open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_dma2d.c
static int bk7258_dma2d_start_locked(FAR struct bk7258_dma2d_s *priv,
                                     uint32_t timeout_ms)
{
  FAR clock_t ticks;
  bk_err_t sdkret;
  int ret;

  ret = nxsem_reset(&priv->completion, 0);
  if (ret < 0)
    {
      return ret;
    }

  priv->irq_result = BK7258_DMA2D_IRQ_PENDING;
  priv->operation_active = true;

  /* Publish CPU buffer stores and all preceding DMA2D register writes before
   * the start bit becomes visible to the accelerator.  The current AP profile
   * keeps D-cache disabled, but normal SRAM still requires ordering against
   * the device transaction. */

  __asm volatile ("dmb sy" ::: "memory");

  sdkret = bk_dma2d_start_transfer();
  ret = bk7258_dma2d_sdk_error(sdkret);
  if (ret < 0)
    {
      priv->operation_active = false;
      priv->faulted = true;
      return ret;
    }

  bk7258_dma2d_timeout(timeout_ms, &ticks);
  ret = nxsem_tickwait_uninterruptible(&priv->completion, ticks);
  priv->operation_active = false;

  /* Order accelerator writes before the caller inspects its destination.
   * Cache maintenance remains the caller's responsibility if a future board
   * enables a cacheable mapping. */

  __asm volatile ("dmb sy" ::: "memory");

  if (ret < 0)
    {
      if (ret == -ETIMEDOUT)
        {
          /* The public SDK has no bounded abort API.  Stop prevents a new
           * start, and the instance is poisoned until deinitialized so that
           * a potentially still-running DMA transfer cannot be reused. */

          (void)bk_dma2d_stop_transfer();
          priv->faulted = true;
        }

      return ret;
    }

  ret = priv->irq_result;
  if (ret < 0)
    {
      priv->faulted = true;
    }

  return ret;
}

static int bk7258_dma2d_check_handle(FAR struct bk7258_dma2d_s *priv)
{
  if (priv != &g_bk7258_dma2d)
    {
      return -EINVAL;
    }

  if (!priv->initialized)
    {
      return -ENODEV;
    }

  if (priv->faulted)
    {
      return -EIO;
    }

  return 0;
}

/* BK7258 retains transfer-mode state across operations.  In particular, an
 * R2M fill followed by an M2M/PFC copy can complete without moving source
 * data.  Reinitialize the engine before programming a different mode, then
 * restore the settings that the v3.1.1.9 SDK and the Tuya integration
 * establish on their single-mode initialization paths. */

static int
bk7258_dma2d_prepare_mode_locked(FAR struct bk7258_dma2d_s *priv,
                                 dma2d_mode_t mode)
{
  bk_err_t sdkret;
  int ret;

  if (priv->mode_valid && priv->last_mode != mode)
    {
      /* A module soft-reset is insufficient on BK7258: R2M state still
       * survives into a following PFC/M2M operation.  The v3.1.1.9 public
       * deinit/init sequence power-cycles VIDP and is the smallest sequence
       * proven to restore source reads.  Rebuild the SDK ISR callbacks and
       * move its CPU2 route back to the NuttX AP primary afterwards. */

      (void)bk_dma2d_int_enable(BK7258_DMA2D_IRQ_MASK, false);
      bk7258_dma2d_unroute_ap_primary_irq();

      ret = bk7258_dma2d_sdk_error(bk_dma2d_driver_deinit());
      if (ret < 0)
        {
          goto fail;
        }

      ret = bk7258_dma2d_sdk_error(bk_dma2d_driver_init());
      if (ret < 0)
        {
          goto fail;
        }

      ret = bk7258_dma2d_route_irq_to_ap_primary();
      if (ret < 0)
        {
          goto fail_initialized;
        }

      sdkret = bk_dma2d_register_int_callback_isr(
        DMA2D_TRANS_COMPLETE_ISR, bk7258_dma2d_complete_isr, priv);
      ret = bk7258_dma2d_sdk_error(sdkret);
      if (ret < 0)
        {
          goto fail_initialized;
        }

      sdkret = bk_dma2d_register_int_callback_isr(
        DMA2D_TRANS_ERROR_ISR, bk7258_dma2d_error_isr, priv);
      ret = bk7258_dma2d_sdk_error(sdkret);
      if (ret < 0)
        {
          goto fail_initialized;
        }

      sdkret = bk_dma2d_register_int_callback_isr(
        DMA2D_CFG_ERROR_ISR, bk7258_dma2d_error_isr, priv);
      ret = bk7258_dma2d_sdk_error(sdkret);
      if (ret < 0)
        {
          goto fail_initialized;
        }

      ret = bk7258_dma2d_sdk_error(
        bk_dma2d_int_enable(BK7258_DMA2D_IRQ_MASK, true));
      if (ret < 0)
        {
          goto fail_initialized;
        }
    }

  priv->last_mode = mode;
  priv->mode_valid = true;
  return 0;

fail_initialized:
  bk7258_dma2d_unroute_ap_primary_irq();
  (void)bk_dma2d_int_enable(BK7258_DMA2D_IRQ_MASK, false);
  (void)bk_dma2d_register_int_callback_isr(DMA2D_TRANS_COMPLETE_ISR,
                                            NULL, NULL);
  (void)bk_dma2d_register_int_callback_isr(DMA2D_TRANS_ERROR_ISR, NULL,
                                            NULL);
  (void)bk_dma2d_register_int_callback_isr(DMA2D_CFG_ERROR_ISR, NULL, NULL);
  (void)bk_dma2d_driver_deinit();

fail:
  priv->mode_valid = false;
  priv->faulted = true;
  return ret;
}

static int bk7258_dma2d_arm_locked(void)
{
  FAR volatile uint32_t *module_ctrl =
    (FAR volatile uint32_t *)BK7258_DMA2D_MODULE_CTRL_REG;

  *module_ctrl |= BK7258_DMA2D_MODULE_CLK_GATE;
  dma2d_driver_transfes_ability(TRANS_16BYTES);
  __asm volatile ("dmb sy" ::: "memory");

  return bk7258_dma2d_sdk_error(
    bk_dma2d_int_enable(BK7258_DMA2D_IRQ_MASK, true));
}

int bk7258_dma2d_initialize(FAR struct bk7258_dma2d_s **out)
{
  FAR struct bk7258_dma2d_s *priv = &g_bk7258_dma2d;
  bk_err_t sdkret;
  int ret;

  if (out == NULL)
    {
      return -EINVAL;
    }

  *out = NULL;
  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  if (priv->initialized)
    {
      nxmutex_unlock(&priv->lock);
      return -EBUSY;
    }

  sdkret = bk_dma2d_driver_init();
  ret = bk7258_dma2d_sdk_error(sdkret);
  if (ret < 0)
    {
      nxmutex_unlock(&priv->lock);
      return ret;
    }

  ret = bk7258_dma2d_route_irq_to_ap_primary();
  if (ret < 0)
    {
      (void)bk_dma2d_driver_deinit();
      nxmutex_unlock(&priv->lock);
      return ret;
    }

  sdkret = bk_dma2d_register_int_callback_isr(DMA2D_TRANS_COMPLETE_ISR,
                                               bk7258_dma2d_complete_isr,
                                               priv);
  ret = bk7258_dma2d_sdk_error(sdkret);
  if (ret < 0)
    {
      goto fail;
    }

