open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_dma2d.c
  sdkret = bk_dma2d_register_int_callback_isr(DMA2D_TRANS_ERROR_ISR,
                                               bk7258_dma2d_error_isr, priv);
  ret = bk7258_dma2d_sdk_error(sdkret);
  if (ret < 0)
    {
      goto fail;
    }

  sdkret = bk_dma2d_register_int_callback_isr(DMA2D_CFG_ERROR_ISR,
                                               bk7258_dma2d_error_isr, priv);
  ret = bk7258_dma2d_sdk_error(sdkret);
  if (ret < 0)
    {
      goto fail;
    }

  sdkret = bk_dma2d_int_enable(BK7258_DMA2D_IRQ_MASK, true);
  ret = bk7258_dma2d_sdk_error(sdkret);
  if (ret < 0)
    {
      goto fail;
    }

  priv->faulted = false;
  priv->mode_valid = false;
  priv->initialized = true;
  *out = priv;
  nxmutex_unlock(&priv->lock);
  return 0;

fail:
  bk7258_dma2d_unroute_ap_primary_irq();
  (void)bk_dma2d_int_enable(BK7258_DMA2D_IRQ_MASK, false);
  (void)bk_dma2d_register_int_callback_isr(DMA2D_TRANS_COMPLETE_ISR,
                                            NULL, NULL);
  (void)bk_dma2d_register_int_callback_isr(DMA2D_TRANS_ERROR_ISR, NULL,
                                            NULL);
  (void)bk_dma2d_register_int_callback_isr(DMA2D_CFG_ERROR_ISR, NULL, NULL);
  (void)bk_dma2d_driver_deinit();
  nxmutex_unlock(&priv->lock);
  return ret;
}

int bk7258_dma2d_uninitialize(FAR struct bk7258_dma2d_s *priv)
{
  bk_err_t sdkret;
  int ret;
  int cleanup_ret;
  int deinit_ret;

  if (priv != &g_bk7258_dma2d)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!priv->initialized)
    {
      nxmutex_unlock(&priv->lock);
      return 0;
    }

  /* Operations hold this mutex from SDK configuration through completion,
   * so a concurrent uninitialize cannot tear down an active callback path. */

  cleanup_ret = bk7258_dma2d_sdk_error(bk_dma2d_stop_transfer());
  if (cleanup_ret < 0 && ret == 0)
    {
      ret = cleanup_ret;
    }

  sdkret = bk_dma2d_int_enable(BK7258_DMA2D_IRQ_MASK, false);
  cleanup_ret = bk7258_dma2d_sdk_error(sdkret);
  if (cleanup_ret < 0 && ret == 0)
    {
      ret = cleanup_ret;
    }

  (void)bk_dma2d_register_int_callback_isr(DMA2D_TRANS_COMPLETE_ISR,
                                            NULL, NULL);
  (void)bk_dma2d_register_int_callback_isr(DMA2D_TRANS_ERROR_ISR, NULL,
                                            NULL);
  (void)bk_dma2d_register_int_callback_isr(DMA2D_CFG_ERROR_ISR, NULL, NULL);

  bk7258_dma2d_unroute_ap_primary_irq();
  sdkret = bk_dma2d_driver_deinit();
  deinit_ret = bk7258_dma2d_sdk_error(sdkret);
  if (deinit_ret < 0 && ret == 0)
    {
      ret = deinit_ret;
    }

  priv->operation_active = false;
  if (deinit_ret < 0)
    {
      /* Keep ownership visible when the SDK did not tear down its driver.
       * The next uninitialize call can retry the public deinit operation,
       * while data operations remain fail-closed through faulted. */

      priv->faulted = true;
    }
  else
    {
      priv->faulted = false;
      priv->mode_valid = false;
      priv->initialized = false;
    }

  nxmutex_unlock(&priv->lock);
  return ret;
}

int bk7258_dma2d_copy(FAR struct bk7258_dma2d_s *priv,
                      FAR const struct bk7258_dma2d_copy_s *copy)
{
  dma2d_memcpy_pfc_t sdk;
  input_color_mode_t input_format;
  out_color_mode_t output_format;
  data_reverse_t input_reverse;
  data_reverse_t output_reverse;
  red_blue_swap_t input_swap;
  red_blue_swap_t output_swap;
  int src_bytes;
  int dst_bytes;
  int ret;
  bool pfc;
  uintptr_t src_start;
  uintptr_t src_end;
  uintptr_t dst_start;
  uintptr_t dst_end;

  if (copy == NULL)
    {
      return -EINVAL;
    }

  src_bytes = bk7258_dma2d_pixel_bytes(copy->src_format);
  dst_bytes = bk7258_dma2d_pixel_bytes(copy->dst_format);
  ret = bk7258_dma2d_map_input(copy->src_format, &input_format);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_map_output(copy->dst_format, &output_format);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_map_reverse(copy->src_reverse, &input_reverse);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_map_reverse(copy->dst_reverse, &output_reverse);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_map_swap(copy->src_swap, &input_swap);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_map_swap(copy->dst_swap, &output_swap);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_validate_extent(copy->src, copy->src_frame_width,
                                     copy->src_frame_height, copy->src_x,
                                     copy->src_y, copy->width, copy->height,
                                     src_bytes);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_validate_extent(copy->dst, copy->dst_frame_width,
                                     copy->dst_frame_height, copy->dst_x,
                                     copy->dst_y, copy->width, copy->height,
                                     dst_bytes);
  if (ret < 0)
    {
      return ret;
    }

  bk7258_dma2d_cache_bounds(copy->src, copy->src_frame_width,
                            copy->src_x, copy->src_y, copy->width,
                            copy->height, src_bytes, &src_start, &src_end);
  bk7258_dma2d_cache_bounds(copy->dst, copy->dst_frame_width,
                            copy->dst_x, copy->dst_y, copy->width,
                            copy->height, dst_bytes, &dst_start, &dst_end);

  /* Raw M2M is a 32-bit word copy on BK7258.  Other pixel widths must use
   * PFC even when the source and destination formats are identical. */

  pfc = src_bytes != FOUR_BYTES || dst_bytes != FOUR_BYTES ||
        copy->src_format != copy->dst_format ||
        copy->src_swap != BK7258_DMA2D_SWAP_REGULAR ||
        copy->dst_swap != BK7258_DMA2D_SWAP_REGULAR ||
        copy->src_reverse != BK7258_DMA2D_REVERSE_NONE ||
        copy->dst_reverse != BK7258_DMA2D_REVERSE_NONE ||
        copy->input_alpha != 0 || copy->output_alpha != 0;

  sdk = (dma2d_memcpy_pfc_t){0};
  sdk.mode = pfc ? DMA2D_M2M_PFC : DMA2D_M2M;
  sdk.input_addr = (void *)(uintptr_t)copy->src;
  sdk.src_frame_width = copy->src_frame_width;
  sdk.src_frame_height = copy->src_frame_height;
  sdk.src_frame_xpos = copy->src_x;
  sdk.src_frame_ypos = copy->src_y;
  sdk.input_color_mode = input_format;
  sdk.src_pixel_byte = (color_bytes_t)src_bytes;
  sdk.input_data_reverse = input_reverse;
  sdk.input_red_blue_swap = input_swap;
  sdk.output_addr = copy->dst;
  sdk.dst_frame_width = copy->dst_frame_width;
  sdk.dst_frame_height = copy->dst_frame_height;
  sdk.dst_frame_xpos = copy->dst_x;
  sdk.dst_frame_ypos = copy->dst_y;
  sdk.output_color_mode = output_format;
  sdk.dst_pixel_byte = (color_bytes_t)dst_bytes;
  sdk.output_red_blue_swap = output_swap;
  sdk.out_byte_by_byte_reverse = output_reverse;
  sdk.dma2d_width = copy->width;
  sdk.dma2d_height = copy->height;
  sdk.input_alpha = copy->input_alpha;
  sdk.output_alpha = copy->output_alpha;

