open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_dma2d.c
  ret = nxmutex_lock(&g_bk7258_dma2d.lock);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_check_handle(priv);
  if (ret >= 0)
    {
      /* DMA2D is not cache coherent with the AP cores.  Publish CPU writes
       * before DMA reads, and discard any dirty/stale destination lines
       * before and after DMA ownership. */

      up_clean_dcache(src_start, src_end);
      up_flush_dcache(dst_start, dst_end);

      ret = bk7258_dma2d_prepare_mode_locked(priv, sdk.mode);

      /* This SDK configuration function has a void return type.  Any
       * hardware configuration failure is therefore reported by its ISR;
       * no unconditional success is inferred here. */

      if (ret >= 0)
        {
          bk_dma2d_memcpy_or_pixel_convert(&sdk);
          ret = bk7258_dma2d_arm_locked();
        }

      if (ret >= 0)
        {
          ret = bk7258_dma2d_start_locked(priv, copy->timeout_ms);
        }

      if (ret >= 0)
        {
          up_invalidate_dcache(dst_start, dst_end);
        }
    }

  nxmutex_unlock(&g_bk7258_dma2d.lock);
  return ret;
}

int bk7258_dma2d_fill(FAR struct bk7258_dma2d_s *priv,
                      FAR const struct bk7258_dma2d_fill_s *fill)
{
  dma2d_fill_t sdk;
  out_color_mode_t output_format;
  int pixel_bytes;
  int ret;
  uintptr_t dst_start;
  uintptr_t dst_end;

  if (fill == NULL)
    {
      return -EINVAL;
    }

  pixel_bytes = bk7258_dma2d_pixel_bytes(fill->format);
  ret = bk7258_dma2d_map_output(fill->format, &output_format);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_validate_extent(fill->dst, fill->frame_width,
                                     fill->frame_height, fill->x, fill->y,
                                     fill->width, fill->height, pixel_bytes);
  if (ret < 0)
    {
      return ret;
    }

  bk7258_dma2d_cache_bounds(fill->dst, fill->frame_width,
                            fill->x, fill->y, fill->width, fill->height,
                            pixel_bytes, &dst_start, &dst_end);

  sdk = (dma2d_fill_t){0};
  sdk.frameaddr = fill->dst;
  sdk.frame_xsize = fill->frame_width;
  sdk.frame_ysize = fill->frame_height;
  sdk.xpos = fill->x;
  sdk.ypos = fill->y;
  sdk.width = fill->width;
  sdk.height = fill->height;
  sdk.color_format = output_format;
  sdk.pixel_byte = (color_bytes_t)pixel_bytes;
  sdk.color = fill->color;

  ret = nxmutex_lock(&g_bk7258_dma2d.lock);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_check_handle(priv);
  if (ret >= 0)
    {
      up_flush_dcache(dst_start, dst_end);
      ret = bk7258_dma2d_prepare_mode_locked(priv, DMA2D_R2M);
      if (ret >= 0)
        {
          ret = bk7258_dma2d_sdk_error(dma2d_fill(&sdk));
        }

      if (ret >= 0)
        {
          ret = bk7258_dma2d_arm_locked();
          if (ret >= 0)
            {
              ret = bk7258_dma2d_start_locked(priv, fill->timeout_ms);
            }

          if (ret >= 0)
            {
              up_invalidate_dcache(dst_start, dst_end);
            }
        }
    }

  nxmutex_unlock(&g_bk7258_dma2d.lock);
  return ret;
}

int bk7258_dma2d_blend(FAR struct bk7258_dma2d_s *priv,
                       FAR const struct bk7258_dma2d_blend_s *blend)
{
  dma2d_offset_blend_t sdk;
  input_color_mode_t foreground_format;
  input_color_mode_t background_format;
  out_color_mode_t dst_format;
  blend_alpha_mode_t foreground_alpha;
  blend_alpha_mode_t background_alpha;
  red_blue_swap_t foreground_swap;
  red_blue_swap_t background_swap;
  red_blue_swap_t dst_swap;
  data_reverse_t foreground_reverse;
  data_reverse_t output_reverse;
  int foreground_bytes;
  int background_bytes;
  int dst_bytes;
  int ret;
  uintptr_t foreground_start;
  uintptr_t foreground_end;
  uintptr_t background_start;
  uintptr_t background_end;
  uintptr_t dst_start;
  uintptr_t dst_end;

  if (blend == NULL)
    {
      return -EINVAL;
    }

  foreground_bytes = bk7258_dma2d_pixel_bytes(blend->foreground_format);
  background_bytes = bk7258_dma2d_pixel_bytes(blend->background_format);
  dst_bytes = bk7258_dma2d_pixel_bytes(blend->dst_format);
  ret = bk7258_dma2d_map_input(blend->foreground_format,
                               &foreground_format);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_map_input(blend->background_format,
                               &background_format);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_map_output(blend->dst_format, &dst_format);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_map_alpha(blend->foreground_alpha_mode,
                               &foreground_alpha);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_map_alpha(blend->background_alpha_mode,
                               &background_alpha);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_map_swap(blend->foreground_swap, &foreground_swap);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_map_swap(blend->background_swap, &background_swap);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_map_swap(blend->dst_swap, &dst_swap);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_map_reverse(blend->foreground_reverse,
                                 &foreground_reverse);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_map_reverse(blend->output_reverse, &output_reverse);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_validate_extent(blend->foreground,
                                     blend->foreground_frame_width,
                                     blend->foreground_frame_height,
                                     blend->foreground_x,
                                     blend->foreground_y, blend->width,
                                     blend->height, foreground_bytes);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_validate_extent(blend->background,
                                     blend->background_frame_width,
                                     blend->background_frame_height,
                                     blend->background_x,
                                     blend->background_y, blend->width,
                                     blend->height, background_bytes);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_validate_extent(blend->dst, blend->dst_frame_width,
                                     blend->dst_frame_height, blend->dst_x,
                                     blend->dst_y, blend->width, blend->height,
                                     dst_bytes);
  if (ret < 0)
    {
      return ret;
    }

