open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_dma2d.c
  bk7258_dma2d_cache_bounds(blend->foreground,
                            blend->foreground_frame_width,
                            blend->foreground_x, blend->foreground_y,
                            blend->width, blend->height, foreground_bytes,
                            &foreground_start, &foreground_end);
  bk7258_dma2d_cache_bounds(blend->background,
                            blend->background_frame_width,
                            blend->background_x, blend->background_y,
                            blend->width, blend->height, background_bytes,
                            &background_start, &background_end);
  bk7258_dma2d_cache_bounds(blend->dst, blend->dst_frame_width,
                            blend->dst_x, blend->dst_y, blend->width,
                            blend->height, dst_bytes, &dst_start, &dst_end);

  sdk = (dma2d_offset_blend_t){0};
  sdk.pfg_addr = (void *)(uintptr_t)blend->foreground;
  sdk.pbg_addr = (void *)(uintptr_t)blend->background;
  sdk.pdst_addr = blend->dst;
  sdk.fg_color_mode = foreground_format;
  sdk.bg_color_mode = background_format;
  sdk.dst_color_mode = dst_format;
  sdk.fg_frame_xpos = blend->foreground_x;
  sdk.fg_frame_ypos = blend->foreground_y;
  sdk.bg_frame_xpos = blend->background_x;
  sdk.bg_frame_ypos = blend->background_y;
  sdk.dst_frame_xpos = blend->dst_x;
  sdk.dst_frame_ypos = blend->dst_y;
  sdk.fg_frame_width = blend->foreground_frame_width;
  sdk.fg_frame_height = blend->foreground_frame_height;
  sdk.bg_frame_width = blend->background_frame_width;
  sdk.bg_frame_height = blend->background_frame_height;
  sdk.dst_frame_width = blend->dst_frame_width;
  sdk.dst_frame_height = blend->dst_frame_height;
  sdk.dma2d_width = blend->width;
  sdk.dma2d_height = blend->height;
  sdk.fg_alpha_mode = foreground_alpha;
  sdk.bg_alpha_mode = background_alpha;
  sdk.fg_alpha_value = blend->foreground_alpha;
  sdk.bg_alpha_value = blend->background_alpha;
  sdk.fg_red_blue_swap = foreground_swap;
  sdk.bg_red_blue_swap = background_swap;
  sdk.dst_red_blue_swap = dst_swap;
  sdk.fg_pixel_byte = (color_bytes_t)foreground_bytes;
  sdk.bg_pixel_byte = (color_bytes_t)background_bytes;
  sdk.dst_pixel_byte = (color_bytes_t)dst_bytes;
  sdk.input_data_reverse = foreground_reverse;
  sdk.out_byte_by_byte_reverse = output_reverse;

  ret = nxmutex_lock(&g_bk7258_dma2d.lock);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_dma2d_check_handle(priv);
  if (ret >= 0)
    {
      up_clean_dcache(foreground_start, foreground_end);
      up_clean_dcache(background_start, background_end);
      up_flush_dcache(dst_start, dst_end);
      ret = bk7258_dma2d_prepare_mode_locked(priv, DMA2D_M2M_BLEND);
      if (ret >= 0)
        {
          ret = bk7258_dma2d_sdk_error(bk_dma2d_offset_blend(&sdk));
        }

      if (ret >= 0)
        {
          ret = bk7258_dma2d_arm_locked();
          if (ret >= 0)
            {
              ret = bk7258_dma2d_start_locked(priv, blend->timeout_ms);
            }

          if (ret >= 0)
            {
              up_invalidate_dcache(dst_start, dst_end);
            }
        }
    }

  nxmutex_unlock(&g_bk7258_dma2d.lock);
  return ret;
}
